const imglist = 'https://telegra.ph/file/1dc5400999dd2c143251b.jpg'
let handler = async (m, { conn, usedPrefix, usedPrefix: _p, __dirname, text, isPrems })  => conn.sendFile(m.chat, imglist, 'darkman.jpg', `

> *▫️اهلا بك/ي في بوت السلطان*
> *▫️اسم البوت , بوت السلطان*
> *▫️حط قبل كل امر  (.)*
> *▫️اســم الـمطور : يوسف السلطان*
> *▫️اليك القائمه يحب*  ${taguser}
> *▫️هذا البوت صنع بواسطه يوسف السلطان انضم للقناة عبر الواتساب لمعرفه التحديثات القادمه*
> *▫️https://whatsapp.com/channel/0029VaL2bnW0rGiPZq8B5S2M*


> *▫️انستجرام*
> *▫️https://instagram.com/youssef.alsoltan_*

> *• ∙ ∙━━╍━﹝👥﹞━╍━━∙ ∙ •*
> *˼‏👥˹ قـسـم الجروبات╿↶*
> *⋄━───═◞⬪⋇⬪◟═───━⋄* 
> *. لقبني*
> *. لقب*
> *. الالقاب*
> *. طرد*
> *. ضيف*
> *. ترقية*
> *. اعفاء*
> *. تحذير*
> *. حذف_تحذير*
> *. حذف*
> *. منشن*
> *. مخفي*
> *. المشرفين*
> *. لمنشن*
> *. بروفايل*
> *. الجروب*
> *. دعوه*
> *. تغيير_اللينك*
> *. لفل*
> *. جروب*
> *. الترحيب*
> *. المغادره*
> *. ايات*
> *. جروب قفل  فتح*
> *. خط*
> *. توب*
> *. لينك*
> *. يومي*
> *. الماس*
> *. ترتيب_البنك*
> *. شراء*
> *. هجوم*
> *• ∙ ∙━━╍━﹝📿﹞━╍━━∙ ∙ •*
> *˼‏✨˹ قـسـم الديني╿↶*
> *⋄━───═◞⬪⋇⬪◟═───━⋄*
> *. سورة*
> *. حديث*
> *. قران*
> *. الله*
> *• ∙ ∙━━╍━﹝⚙️﹞━╍━━∙ ∙ •*
> *˼‏🙎🏻˹ قـسـم المطور╿↶*
> *⋄━───═◞⬪⋇⬪◟═───━⋄*
> *. ضيف_بريميام*
> *. حذف_بريميام*
> *. بان*
> *. الغاء_البان*
> *. اطفاء*
> *. تفعيل*
> *. المبندين*
> *. إعادة*
> *. اعادةتشغيل*
> *. أدخل*
> *. ضيف_اكس_بي*
> *. ضيف_جواهر*
> *• ∙ ∙━━╍━﹝📁﹞━╍━━∙ ∙ •*
> *˼‏📥˹ قـسـم التنزيلات╿↶*
> *⋄━───═◞⬪⋇⬪◟═───━⋄*
> *. انستغرام*
> *. انستا*
> *. شغل*
> *. تيكتوك*
> *. تويتر*
> *. اغنية*
> *. بحث*
> *. فيديو*
> *. تطبيق*
> *. صوره*
> *• ∙ ∙━━╍━﹝🕹️﹞━╍━━∙ ∙ •*
> *˼‏🎮˹ قـسـم الترفيه╿↶*
> *⋄━───═◞⬪⋇⬪◟═───━⋄*
> *. اكس او*
> *. ت*
> *. صراحه*
> *. بوت*
> *. ايدت*
> *. فيك*
> *. ميمز*
> *. اختبرني*
> *. تهكير*
> *. لو*
> *. هل*
> *. ترجم*
> *. احزر*
> *. زواج*
> *. انطق*
> *. تاج*
> *. حكمه*
> *. ميمز*
> *. سوال*
> *• ∙ ∙━━╍━﹝💡﹞━╍━━∙ ∙ •*
> *˼‏🛠️˹ قـسـم التحويل╿↶*
> *⋄━───═◞⬪⋇⬪◟═───━⋄*
> *. ملصق*
> *. جوده*
> *. سرقة*
> *. لفيديو*
> *. لصورة*
> *. لانمي*
> *. تخيل*
> *. مكس*
> *. لجواهر*
> *. ستك*
> *. تلجراف*
> *. لكرتون*
> *. باركود*
> *• ∙ ∙━━╍━﹝🎚️﹞━╍━━∙ ∙ •*
> *˼‏🎹˹ قـسـم الصوتيات╿↶*
> *⋄━───═◞⬪⋇⬪◟═───━⋄*
> *. عميق*
> *. منفوخ*
> *. تخين*
> *. صاخب*
> *. سريع*
> *. تخينن*
> *. رفيع*
> *. روبوت*
> *. بطيء*
> *. ناعم*
> *. سنجاب*

> *⚠️┑━━━ملاحظه━━━┍⚠️*
> *البوت قيد التطوير لذا عندما لا يتسجيب*
> *فأعلم انه يتم اعادة تشغيله لان تم*
> *اضافه بعض الاوامر وشكرا علي استخدامك البوت*
> *⚠️━━━━━━━━━━━━⚠️*

> 👾┑━━━حـقـوق الـمـطـور━━━┍👾
> *❗⇆ معلومات الـمطـور  ↯*
> ❗ده  instagram.com/youssef.alsoltan_
> *❗⇆ رقـم الـمطـور  ↯*
> ❗ده  https://wa.me/+201277272498
> 👾━━━حـقـوق الـمـطـور━━━👾

`.trim(), m)
handler.help = ['allmenu']
handler.tags = ['main']
handler.command = ['list', 'menu','أوامر','اوامر','الاوامر','مهام'] 

export default handler
